BankBung/advanced/frontend/controllers/ApiController.php

SELECT COUNT(*) FROM `transaksi` WHERE (`kode_transaksi`='dctsh5i2ezv') AND (`jumlah`=500000)
---
    public function getIndex($kodetransaksi,$jumlah)
    {
         if(Transaksi::find()->where(['kode_transaksi'=>$kodetransaksi])->andWhere(['jumlah'=>$jumlah])->count()==0){