BankBung/advanced/frontend/controllers/TransaksiController.php

    public function actionCreate()
    {
        $model = new Transaksi();
        $user = Yii::$app->user->identity->id;
        $asal = Nasabah::find()->where(['id_akun'=>$user])->one();
        if ($model->load(Yii::$app->request->post()))
        {
            if(Nasabah::find()->where(['nomor_rekening' => $model->tujuan])->count()==0)
            {
                Yii::$app->session->setFlash('danger', 'Nomor Rekening Tujuan Tidak Terdaftar!!');
                return $this->redirect(['create']);
            }
            else
            {
                $tujuan = Nasabah::find()->where(['nomor_rekening'=>$model->tujuan])->one();
                //echo $tujuan->nomor_rekening.'<br>';
                //echo $asal->nomor_rekening;
                $model->rekening_asal = $asal->id;
                $model->rekening_tujuan = $tujuan->id;
                $date = date('Y-m-d H:i:s');
                $model->waktu_tansaksi = $date;
                $model->jenis_transaksi = "keluar";
                //die();
                $model->save();
---
SELECT * FROM `nasabah` WHERE `id_akun`=2
SELECT COUNT(*) FROM `nasabah` WHERE `nomor_rekening`='11111111'
SELECT * FROM `nasabah` WHERE `nomor_rekening`='11111111'
INSERT INTO `transaksi` (`kode_transaksi`, `jumlah`, `rekening_asal`, `rekening_tujuan`, `waktu_tansaksi`, `jenis_transaksi`) VALUES ('dctsh5i2ezv', 500000, 2, 1, '2016-05-23 16:27:50', 'keluar')

                $transaksi->rekening_asal = $model->rekening_asal;
                $transaksi->rekening_tujuan = $model->rekening_tujuan;
                $transaksi->waktu_tansaksi = $date;
                $transaksi->save(false);
---
INSERT INTO `transaksi` (`jumlah`, `jenis_transaksi`, `kode_transaksi`, `rekening_asal`, `rekening_tujuan`, `waktu_tansaksi`) VALUES (500000, 'masuk', 'dctsh5i2ezv', 2, 1, '2016-05-23 16:27:50')

    protected function findModel($id)
    {
        if (($model = Transaksi::findOne($id)) !== null) {
---
SELECT * FROM `transaksi` WHERE `id`='24'